src/Catalogs/Книги/Книги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Книги</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НомерКниги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обложка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аннотация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГодИздания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокДляСайта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипКниги</name>
      <type>
        <types>EnumRef.ТипКниги</types>
      </type>
    </attributes>
    <attributes>
      <name>Гиперссылка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Исполнители</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/Цены/Цены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Цены</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Гиперссылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Книга</name>
    <type>
      <types>CatalogRef.Книги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипКниги</name>
    <type>
      <types>EnumRef.ТипКниги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Книги/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТоварыПередУдалениемНаСервере(Объект.Ссылка, ТекущиеДанные.ТипКниги, ТекущиеДанные.Магазин);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Товары перед удалением на сервере.
// 
// Параметры:
//  Книга - СправочникСсылка.Книги - Книга
//  ТипКниги - ПеречислениеСсылка.ТипКниги - Тип книги
//  Магазин - СправочникСсылка.Магазины - Магазин
&НаСервереБезКонтекста
Процедура ТоварыПередУдалениемНаСервере(Книга, ТипКниги, Магазин)

	Если ЗначениеЗаполнено(Книга) И ЗначениеЗаполнено(ТипКниги) И ЗначениеЗаполнено(Магазин) Тогда

		НаборЗаписей = РегистрыСведений.Цены.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Книга.Установить(Книга);
		НаборЗаписей.Отбор.ТипКниги.Установить(ТипКниги);
		НаборЗаписей.Отбор.Магазин.Установить(Магазин);
		НаборЗаписей.Записать();

	КонецЕсли;

КонецПроцедуры
#КонецОбласти
